#+TITLE: Dev Docs

* About
This DBT/Mindfulness app will provide a way to track customizable skills, offer practices and provide data on progress.

It will be a web-based application. The home-screen will require the user to log into their account. They will then be able to select the date from a calendar they want to add data. It will display the skills they have chosen have displayed and they will input data. The data will be saved in the database. Users can view historical data and view the help section.

* Approach
- problem-based learning drawn from "Zero to Prod in Rust"
** User Stories
- capture the who we are building it for, the actions they want to perform, and their motives
- as a ... I want to.. so that...
1) As a user,
    I want to store my scores for multiple skills each day,
    So that I can track progress
2) As a user,
    I want to view stored scores,
    So that I can review progress
** Strategy
- choose a web framework
- define testing strategy
- choose a crate
** To do
- define struct for skills table
- fix return type for insert_entry fn, should not be a string until it needs to be
- need to wrap get_data in another function (as it currently returns HttpResponse or sqlx error, don't want to leak internal )
* Linting and Formatting
** Linting
#+begin_src
cargo clippy
#+end_src
** Formatting
#+begin_src
cargo fmt
#+end_src
* Docker
** Launch Postgres server
#+begin_src shell
chmod +x scripts/init_db.sh
./scripts/init_db.sh
#+end_src

#+RESULTS:
| c8ab39118f46a92d46930915da95c45376de7aa9d08f70d681c9f5e8453dadbd |                        |                                                                                                                                                                                                                                                          |        |         |       |           |
| declare                                                          | -x                     | 15;0                                                                                                                                                                                                                                                     |        |         |       |           |
| declare                                                          | -x                     | truecolor                                                                                                                                                                                                                                                |        |         |       |           |
| declare                                                          | -x                     | unix2003                                                                                                                                                                                                                                                 |        |         |       |           |
| declare                                                          | -x                     | Ariel                                                                                                                                                                                                                                                    |        |         |       |           |
| declare                                                          | -x                     | Disthene.local                                                                                                                                                                                                                                           |        |         |       |           |
| declare                                                          | -x                     | /Users/ariel/.zsh_history                                                                                                                                                                                                                                |        |         |       |           |
| declare                                                          | -x                     | /Users/ariel                                                                                                                                                                                                                                             |        |         |       |           |
| declare                                                          | -x                     | /opt/homebrew/Cellar                                                                                                                                                                                                                                     |        |         |       |           |
| declare                                                          | -x                     | /opt/homebrew                                                                                                                                                                                                                                            |        |         |       |           |
| declare                                                          | -x                     | /opt/homebrew                                                                                                                                                                                                                                            |        |         |       |           |
| declare                                                          | -x                     | /opt/homebrew                                                                                                                                                                                                                                            |        |         |       |           |
| declare                                                          | -x                     | /opt/homebrew/share/info:                                                                                                                                                                                                                                |        |         |       |           |
| declare                                                          | -x                     | Default                                                                                                                                                                                                                                                  |        |         |       |           |
| declare                                                          | -x                     | w0t1p0:408929A3-FEA1-4495-B7C3-78A27021BA1F                                                                                                                                                                                                              |        |         |       |           |
| declare                                                          | -x                     | en_CA.UTF-8                                                                                                                                                                                                                                              |        |         |       |           |
| declare                                                          | -x                     | iTerm2                                                                                                                                                                                                                                                   |        |         |       |           |
| declare                                                          | -x                     | 3.4.12                                                                                                                                                                                                                                                   |        |         |       |           |
| declare                                                          | -x                     | ariel                                                                                                                                                                                                                                                    |        |         |       |           |
| declare                                                          | -x                     | CD40051B-F6CB-46C9-B212-9C4512E9E411                                                                                                                                                                                                                     |        |         |       |           |
| declare                                                          | -x                     | /opt/homebrew/share/man::                                                                                                                                                                                                                                |        |         |       |           |
| declare                                                          | -x                     | OLDPWD                                                                                                                                                                                                                                                   |        |         |       |           |
| declare                                                          | -x                     | /Users/ariel/.local/bin:/Users/ariel/.zinit/polaris/bin:/opt/homebrew/bin:/opt/homebrew/sbin:/usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/Library/TeX/texbin:/Users/ariel/.cargo/bin:/Users/ariel/bin:/Users/ariel/.cargo/bin:/Users/ariel/.emacs.d/bin |        |         |       |           |
| declare                                                          | -x                     | password                                                                                                                                                                                                                                                 |        |         |       |           |
| declare                                                          | -x                     | 0uUpiPsf                                                                                                                                                                                                                                                 |        |         |       |           |
| declare                                                          | -x                     | /Users/ariel/dev/shooting-star                                                                                                                                                                                                                           |        |         |       |           |
| declare                                                          | -x                     | 186b9                                                                                                                                                                                                                                                    |        |         |       |           |
| declare                                                          | -x                     | /bin/zsh                                                                                                                                                                                                                                                 |        |         |       |           |
| declare                                                          | -x                     | 3                                                                                                                                                                                                                                                        |        |         |       |           |
| declare                                                          | -x                     | /private/tmp/com.apple.launchd.uxhbk7CzjA/Listeners                                                                                                                                                                                                      |        |         |       |           |
| declare                                                          | -x                     | 1401715107246031                                                                                                                                                                                                                                         |        |         |       |           |
| declare                                                          | -x                     | zsh                                                                                                                                                                                                                                                      |        |         |       |           |
| declare                                                          | -x                     | dumb                                                                                                                                                                                                                                                     |        |         |       |           |
| declare                                                          | -x                     | iTerm.app                                                                                                                                                                                                                                                |        |         |       |           |
| declare                                                          | -x                     | 3.4.12                                                                                                                                                                                                                                                   |        |         |       |           |
| declare                                                          | -x                     | w0t1p0:408929A3-FEA1-4495-B7C3-78A27021BA1F                                                                                                                                                                                                              |        |         |       |           |
| declare                                                          | -x                     | .:/Users/ariel/.emacs.d/.local/straight/build-28.0.50/auctex/latex:                                                                                                                                                                                      |        |         |       |           |
| declare                                                          | -x                     | /var/folders/tb/xxqcp_td4f122vqjvf7nrwm00000gn/T/                                                                                                                                                                                                        |        |         |       |           |
| declare                                                          | -x                     | ariel                                                                                                                                                                                                                                                    |        |         |       |           |
| declare                                                          | -x                     | 0x0                                                                                                                                                                                                                                                      |        |         |       |           |
| declare                                                          | -x                     | 0                                                                                                                                                                                                                                                        |        |         |       |           |
| declare                                                          | -x                     | /Users/ariel/.zinit/polaris                                                                                                                                                                                                                              |        |         |       |           |
| declare                                                          | -x                     | /Users/ariel/.cache/zinit                                                                                                                                                                                                                                |        |         |       |           |
| declare                                                          | -x                     | com.googlecode.iterm2                                                                                                                                                                                                                                    |        |         |       |           |
| declare                                                          | -x                     | 0x1F5:0x0:0x52                                                                                                                                                                                                                                           |        |         |       |           |
| Applied                                                          | 20211011201637/migrate | create                                                                                                                                                                                                                                                   | skills | tracker | table | (4.033ms) |


** Kill Postgres Server
#+begin_src shell
docker kill $(docker ps -q)
#+end_src

#+RESULTS:
: 84e16abd889d

* Postgres
** Migrate Database
#+begin_src shell
SKIP_DOCKER=true ./scripts/init_db.sh
#+end_src

* API
** Health Check
#+begin_src restclient
GET http://localhost:8000/health_check
#+end_src

When running a health check we should return a 200.
#+NAME: Expected Health Check Response
#+BEGIN_SRC js
 // GET http://localhost:8000/health_check
 // HTTP/1.1 200 OK
 // content-length: 0
 // date: Thu, 30 Sep 2021 03:37:37 GMT
 // Request duration 0.029655s
#+END_SRC

#+RESULTS: Expected Health Check Response

** Enter Data
#+begin_src restclient
POST http://localhost:8000/enter_data
Content-Type: application/json
{
"name": "mindfulness",
"completed": true
}
#+end_src

#+RESULTS:
#+begin_example
,#+BEGIN_SRC js
{
  "id": "8118c314-e81b-435e-920b-26b556003ac6",
  "name": "mindfulness",
  "completed": true,
  "created_at": "2021-11-22T07:09:47.804233Z"
}
// POST http://localhost:8000/enter_data
// HTTP/1.1 201 Created
// content-length: 126
// content-type: application/json
// date: Mon, 22 Nov 2021 07:09:47 GMT
// Request duration: 0.065396s
,#+END_SRC
#+end_example

** GET Data
#+begin_src restclient
GET http://localhost:8000/get_data/6b11a905-ca2b-4bcd-9c88-1a2365b53b42
#+end_src

#+RESULTS:
#+begin_example
,#+BEGIN_SRC js
{
  "id": "6b11a905-ca2b-4bcd-9c88-1a2365b53b42",
  "name": "mindfulness",
  "completed": true,
  "created_at": "2021-11-10T03:58:46.323480Z"
}
// GET http://localhost:8000/get_data/6b11a905-ca2b-4bcd-9c88-1a2365b53b42
// HTTP/1.1 200 OK
// content-length: 126
// content-type: application/json
// date: Thu, 11 Nov 2021 18:39:22 GMT
// Request duration: 0.040012s
,#+END_SRC
#+end_example
